#pragma once
namespace Mod_Hub_Base
{
	extern bool Godmode;

	extern bool Invisible;
	extern bool SuperJump;

	extern bool DroP;


	extern bool NeverWanted;
	extern bool InfinityAmmo;
	extern bool VehInvisible;
	extern bool WalkOnWater;
	extern bool FlyCar;
	extern bool SuperRun;
	extern bool SuperRun2;
	extern bool vomit;
	extern bool RandomOutfit;
	extern bool NoClip;

	//void PlayerInfo(std::int32_t player, bool show);

	extern bool BypassRestrictedArea;


	extern bool RPGg;

	extern bool f_SetWanted;

	extern bool AutoTeleportToWaypoint;

	extern bool WorldGlow;

	extern bool WorldGlow2;

	extern bool RedLazerCar;
	extern bool GreenLaserCar;



	extern bool C4;
	extern bool FlareGun;
	extern bool MolotvGun;
	extern bool BZGAS;

	extern bool FrWrkT;
	extern bool LOL;
	extern bool LOL2;
	extern bool LOL3;
	extern bool ShootMini;
	extern bool Shootfireworks;
	extern bool ShootTankR;


	inline int m_Red{ 255 };
	inline int m_Blue{ 0 };
	inline int m_Green{ 0 };



	extern bool ClearArea;

	//static bool to_blip(Blip blip_sprite, int blip_color = -1);
	//static bool to_objective();
	//static void to_coords(Entity e, Vector3 coords, bool AutoCorrectGroundHeight, bool IgnoreCurrentPedVehicle);




	extern bool  InsVeh;



	extern bool  f_Valkyire;

	extern bool ForceField;

	extern bool DefaultHud;

	extern bool m_Head;
	extern bool m_RightHand;
	extern bool m_LeftHand;
	extern bool m_RightFood;
	extern bool m_LeftFood;
	extern bool m_EnableGlow;




	extern bool RainbowNeons;

	extern bool RainbowTireSmoke;

	extern bool DisableHud;







	extern bool DisablePhone;


	extern bool ForceCross;

	extern bool SuperBrakes;

	extern bool JumpAround;

	extern bool ExploAm;
	extern bool AntiAFK;
	extern bool CopsTurn;
	extern bool Snowing;
	extern bool UFOEvent;


	extern bool Y500KL;

	extern bool OffTheRadar;



	//bool WaterLoop;
	//bool FireLoop;


	class CWaterTune
	{
	public:
		DWORD dwWaterColor; //0x0000  Default: 0x1A00191C
		float fRippleScale; //0x0004  Default: 0.040000f
		float fOceanFoamScale; //0x0008  Default: 0.050000f
		float fSpecularFalloff; //0x000C  Default: 1118.000000f
		float fFodPierceIntensity; //0x0010  Default: 1.100000f
		float fRefractionBlend; //0x0014  Default: 0.700000f
		float fRefractionExponent; //0x0018  Default: 0.250000f
		float fWaterCycleDepth; //0x001C  Default: 10.000000f
		float fWaterCycleFade; //0x0020  Default: 50.000000f
		float fWaterLightningDepth; //0x0024  Default: 0.000000f
		float fWaterLightningFade; //0x0028  Default: 10.000000f
		float fDeepWaterModDepth; //0x002C  Default: 90.000000f
		float fDeepWaterModFade; //0x0030  Default: 80.000000f
		float fGodRaysLerpStart; //0x0034  Default: 0.000000f
		float fGodRaysLerpEnd; //0x0038  Default: 200.000000f
		float fDisturbFoamScale; //0x003C  Default: 0.050000f
		void* vec2FogMin; //0x0040  Default: x = -4000.000000 y = -4000.000000
		void* vec2FogMax; //0x0048  Default: x = 4500.000000 y= 8000.000000
	};

	class CWaterDataItem
	{
	public:
		__int16 iMinX; //0x0000 X Coord 1
		__int16 iMinY; //0x0002  Y Coord 1
		__int16 iMaxX; //0x0004 X Coord 2
		__int16 iMaxY; //0x0006 Y Coord 2
		__int8 iAlphaSW; //0x0008  (South West, default 26)
		__int8 iAlphaSE; //0x0009  (South East, default 26)
		__int8 iAlphaNW; //0x000A  (North West, default 26)
		__int8 iAlphaNE; //0x000B  (North East, default 26)
		char _0x000C[8]; // (Unknown, appear to be two floats?)
		float fHeight; //0x0014 (Z-Height, default 0.0)
		BYTE bHasLimitedDepth; //0x0018  (Second bit [binary 10] = On, gives the water quad an effective range of 6 z-points)
		char _0x0019[3]; // (Unknown)
	};//Size=0x001C



	void DisplayVehicle(std::string texture1, std::string texture2);





	/*inline void SelfFeatures(std::uint32_t PlayerId, std::uint32_t PedId) {
*/

	extern bool LAGPLAYER;

	extern bool WaterLoop;
	extern bool FireLoop;



	inline bool m_enabledrop;
	inline int m_drop_delay{ 500 };
	inline int m_drop_value{ 2000 };
	inline float m_drop_pos_x, m_drop_pos_y, m_drop_pos_z{};
	inline const char* m_Droptype[] = { "Money", "Rp" };
	inline std::size_t m_DropIterator;


	static const int GLOBAL_OFFRADAR[] = { 2657589, 466, 210 };
	static const int GLOBAL_COPSTURNBLINDEYE[] = { 2793046, 4654, 5 };
	static const int GLOBAL_NETWORK_STOPWATCH[] = { 2672505, 56 };

	extern bool ExplosiveAmmo2;


	extern bool NoclipV2;
	void noclipv2(bool enable);


	extern bool RPDrop;

	extern bool StealthYES1MIL;


	extern bool Dominos;



